-- 出席番号：
-- 氏名：

-- データベースに接続する
mysql -u root -p

-- 「drill」データベースを選択する
use drill

-- 問1
-- テーブルProductsからPriceが1000以上のProductNameとPriceを求めなさい
-- 結果はPriceの降順(大きい順)とすること

SELECT
  ProductName, Price
FROM
  Products
WHERE
  Price >= 1000
ORDER BY
  Price DESC
;

+----------------+-------+
| ProductName    | Price |
+----------------+-------+
| 上り棒         |  3200 |
| ふかふか座布団 |  2800 |
| 引っ掻き板     |  1500 |
| 首輪           |  1300 |
| トイレトレイ   |  1200 |
+----------------+-------+
5 rows in set (0.001 sec)

-- 問2
-- テーブルEmployeesからEmployeeIDが10以上15以下のEmployeeID、EmployeeName、BirthDay
-- を求めなさい
-- 結果はBirthDayの降順(新しい順)とすること

SELECT
  EmployeeID, EmployeeName, BirthDay
FROM
  Employees
WHERE
  EmployeeID BETWEEN 10 AND 15
ORDER BY
  BirthDay DESC
;

+------------+--------------+------------+
| EmployeeID | EmployeeName | BirthDay   |
+------------+--------------+------------+
|         15 | モンチー     | 1973-05-06 |
|         14 | ニャン太     | 1972-02-03 |
|         13 | 猫丸         | 1972-01-15 |
|         10 | ぴー子       | 1971-11-13 |
|         12 | ぱんだ       | 1971-06-01 |
|         11 | ごま         | 1971-04-15 |
+------------+--------------+------------+
6 rows in set (0.001 sec)

-- 問3
-- テーブルSalesからSaleDateが'2006-09-10'から'2006-09-15'までの
-- SaleID、Quantity、CustomerID、ProductID、SaleDateを求めなさい
-- 結果はCustomerIDの昇順(小さい順)、ProductIDの昇順(小さい順)とする

SELECT
  SaleID, Quantity, CustomerID, ProductID, SaleDate
FROM
  Sales
WHERE
  SaleDate BETWEEN '2006-09-10' AND '2006-09-15'
ORDER BY
  CustomerID, ProductID
;

+--------+----------+------------+-----------+------------+
| SaleID | Quantity | CustomerID | ProductID | SaleDate   |
+--------+----------+------------+-----------+------------+
|     28 |        1 |          2 |         1 | 2006-09-11 |
|     29 |        2 |          2 |         7 | 2006-09-11 |
|     30 |        1 |          2 |        12 | 2006-09-11 |
|     34 |        2 |          4 |         3 | 2006-09-13 |
|     35 |        1 |          4 |        12 | 2006-09-13 |
|     36 |        1 |          4 |        14 | 2006-09-13 |
|     37 |        3 |          9 |        19 | 2006-09-14 |
|     41 |       48 |         10 |        36 | 2006-09-15 |
|     42 |       12 |         10 |        39 | 2006-09-15 |
|     31 |        1 |         26 |        31 | 2006-09-12 |
|     38 |       36 |         27 |        39 | 2006-09-14 |
|     39 |       12 |         27 |        44 | 2006-09-14 |
|     40 |       30 |         28 |        22 | 2006-09-15 |
|     33 |       24 |         30 |        17 | 2006-09-12 |
|     32 |       10 |         30 |        31 | 2006-09-12 |
+--------+----------+------------+-----------+------------+
15 rows in set (0.001 sec)

-- 問4
-- テーブルProductsのPriceが1,000未満のデータをCategoryIDでグループ化し、レコード数が
-- 2以上のCategoryIDとレコード数(列別名は「商品数」)を求めなさい
-- 結果はレコード数の降順(多い順)とする

SELECT
  CategoryID,
  COUNT(*) AS "商品数"
FROM
  Products
WHERE
  Price < 1000
GROUP BY
  CategoryID
HAVING
  COUNT(*) >= 2
ORDER BY
  COUNT(*) DESC
;

+------------+--------+
| CategoryID | 商品数 |
+------------+--------+
|          5 |      6 |
|          1 |      5 |
|          9 |      5 |
|          2 |      5 |
|          3 |      5 |
|          4 |      5 |
|          6 |      5 |
|          8 |      5 |
|         10 |      4 |
+------------+--------+
9 rows in set (0.001 sec)

-- 問5
-- テーブルSalaryをEmployeeIDでグループ化、Amountを平均し、Amountの平均が
-- 400,000以上のEmployeeIDとAmountの平均を求めなさい
-- 列別名はそれぞれ「社員ID」、「給与平均」とする
-- 結果はAmountの平均の昇順(少ない順)とする

SELECT
  EmployeeID AS "社員ID",
  AVG(Amount) AS "給与平均"
FROM
  Salary
GROUP BY
  EmployeeID
HAVING
  AVG(Amount) >= 400000
ORDER BY
  AVG(Amount)
;

+--------+-------------+
| 社員ID | 給与平均    |
+--------+-------------+
|      3 | 418333.3333 |
|      2 | 458333.3333 |
|      1 | 588333.3333 |
+--------+-------------+

-- 問6
-- テーブルBelongToでEndDateがNULL(現在、従業員がその部署に所属していることを表している)
-- を選択し、DepartmentIDでグループ化して、DepartmentIDとレコード数を求めなさい
-- 列別名はそれぞれ「部署ID」、「レコード数」とする
-- 結果はレコード数の昇順(少ない順)とする

SELECT
  DepartmentID AS "部署ID",
  COUNT(*) AS "レコード数"
FROM
  BelongTo
WHERE
  EndDate IS NULL
GROUP BY
  DepartmentID
ORDER BY
  COUNT(*)
;

+--------+------------+
| 部署ID | レコード数 |
+--------+------------+
|      2 |          2 |
|      4 |          2 |
|      6 |          2 |
|      3 |          2 |
|      1 |          6 |
|      5 |         17 |
+--------+------------+
6 rows in set (0.001 sec)

-- 問7
-- テーブルEmployeesから重複を除いてBloodTypeを求めなさい

SELECT DISTINCT
  BloodType
FROM
  Employees
;

+-----------+
| BloodType |
+-----------+
| A         |
| B         |
| O         |
| AB        |
+-----------+
4 rows in set (0.001 sec)

-- 問8
-- テーブルCustomersから重複を除いてPrefecturalIDを求めなさい
-- 結果はPrefecturalIDの昇順(小さい順)とする

SELECT DISTINCT
  PrefecturalID
FROM
  Customers
ORDER BY
  PrefecturalID
;

+---------------+
| PrefecturalID |
+---------------+
|             1 |
|             8 |
|            10 |
|            11 |
|            13 |
|            14 |
|            27 |
|            30 |
|            38 |
+---------------+
9 rows in set (0.001 sec)

-- 問9
-- テーブルEmployeesからHireFiscalYearが2000以降を選択し、
-- 重複を除いてBloodType、HireFiscalYearを求めなさい
-- 結果はHireFiscalYearの昇順(古い順)とする

SELECT DISTINCT
  BloodType, HireFiscalYear
FROM
  Employees
WHERE
  HireFiscalYear >= 2000
ORDER BY
  HireFiscalYear
;

+-----------+----------------+
| BloodType | HireFiscalYear |
+-----------+----------------+
| A         |           2001 |
| A         |           2003 |
| AB        |           2004 |
| O         |           2006 |
| AB        |           2007 |
| B         |           2007 |
+-----------+----------------+
6 rows in set (0.001 sec)

-- 問10
-- テーブルSalesからProductIDが10以下を選択し、
-- 重複を除いてEmployeeID、ProductIDを求めなさい
-- 結果はEmployeeIDの昇順(小さい順)とする


SELECT DISTINCT
  EmployeeID, ProductID
FROM
  Sales
WHERE
  ProductID <= 10
ORDER BY
  EmployeeID
;

+------------+-----------+
| EmployeeID | ProductID |
+------------+-----------+
|          4 |         2 |
|          4 |         6 |
|          4 |         9 |
|          4 |        10 |
|          5 |         2 |
|          5 |         6 |
|          5 |         9 |
|          5 |        10 |
|          6 |         2 |
|          6 |         4 |
|          6 |         5 |
|          6 |         6 |
|          6 |         9 |
|          6 |        10 |
|          7 |         6 |
|          7 |         9 |
|          7 |        10 |
|          8 |        10 |
|         11 |         1 |
|         11 |         2 |
|         11 |         6 |
|         11 |         7 |
|         11 |         8 |
|         11 |         9 |
|         11 |        10 |
|         12 |         9 |
|         12 |        10 |
|         14 |         1 |
|         14 |         2 |
|         14 |         3 |
|         14 |         6 |
|         14 |         7 |
|         14 |         8 |
|         14 |        10 |
|         16 |         2 |
|         16 |         6 |
|         16 |         9 |
|         16 |        10 |
|         17 |         2 |
|         17 |         3 |
|         17 |         4 |
|         17 |         5 |
|         17 |         6 |
|         17 |         9 |
|         18 |         6 |
|         18 |         9 |
|         19 |         1 |
|         19 |         3 |
|         19 |         4 |
|         19 |         5 |
|         19 |         6 |
|         19 |         7 |
|         19 |         9 |
|         19 |        10 |
|         20 |         2 |
|         20 |         6 |
|         20 |         7 |
|         20 |        10 |
|         21 |         1 |
|         21 |         4 |
|         21 |         5 |
|         21 |         6 |
|         21 |         8 |
|         21 |         9 |
|         21 |        10 |
|         22 |         5 |
|         23 |         2 |
|         23 |         5 |
|         23 |         6 |
|         23 |         8 |
|         23 |         9 |
|         23 |        10 |
|         25 |         6 |
|         25 |         9 |
|         25 |        10 |
|         26 |         3 |
|         27 |         4 |
|         27 |         5 |
|         27 |         6 |
|         27 |         9 |
|         27 |        10 |
|         28 |         1 |
|         28 |         2 |
|         28 |         3 |
|         28 |         4 |
|         28 |         5 |
|         28 |         6 |
|         28 |         7 |
|         30 |         6 |
|         30 |         8 |
|         30 |         9 |
|         30 |        10 |
+------------+-----------+
106 rows in set (0.001 sec)

-- 問11
-- テーブルCustomersのCustomerCode列とCustomerName列を取り出しなさい

SELECT
  CustomerCode, CustomerName
FROM
  Customers
;

+--------------+------------------------+
| CustomerCode | CustomerName           |
+--------------+------------------------+
|         2001 | タマ                   |
|         2002 | ハナ                   |
|         2003 | ミケ                   |
|         2004 | キク                   |
|         1005 | ウメ                   |
|         1006 | トラネコ商会           |
|         2007 | クロ                   |
|         2008 | トラ                   |
|         1009 | スーパーニャンコ       |
|         1010 | ぶち雑貨店             |
|         1011 | ミーストア             |
|         2012 | タロ                   |
|         1013 | 雑貨サクラ             |
|         2014 | チー                   |
|         2015 | シロ                   |
|         1016 | 株式会社スズナリ       |
|         1017 | エリザベス商会         |
|         2018 | ポンタ                 |
|         2019 | ジロー                 |
|         2020 | ニャン太               |
|         2021 | ミミ                   |
|         2022 | ミミミ                 |
|         1023 | 有限会社チョコグリーン |
|         2024 | チャー                 |
|         2025 | みーすけ               |
|         2026 | チロ                   |
|         1027 | パーコ株式会社         |
|         1028 | トニー商店             |
|         2029 | ギン                   |
|         1030 | プーストア             |
|         NULL | 有限会社貉商会         |
+--------------+------------------------+
31 rows in set (0.001 sec)


-- 問12
-- テーブルProductsのProductCode列を「商品コード」、ProductName列を「商品名」、Price列を「税抜価格」、Price*1.08を「税込価格」という別名で取り出しなさい

SELECT
  ProductCode AS "商品コード",
  ProductName AS "商品名",
  Price AS "税抜価格",
  Price*1.08 AS "税込価格"
FROM
  Products
;

+------------+----------------------+----------+----------+
| 商品コード | 商品名               | 税抜価格 | 税込価格 |
+------------+----------------------+----------+----------+
|       1001 | まぐろ               |      500 |   540.00 |
|       1002 | 金魚                 |       35 |    37.80 |
|       1003 | ぶり                 |      350 |   378.00 |
|       1004 | あじ                 |      200 |   216.00 |
|       1005 | あなご               |      150 |   162.00 |
|       2006 | ねずみ肉             |      120 |   129.60 |
|       2007 | とり肉               |      200 |   216.00 |
|       2008 | 豚肉                 |      300 |   324.00 |
|       2009 | バッタ肉             |      185 |   199.80 |
|       2010 | 蜘蛛肉               |       98 |   105.84 |
|       3011 | ねこ草               |      120 |   129.60 |
|       3012 | 大根                 |      135 |   145.80 |
|       3013 | いちご               |      480 |   518.40 |
|       3014 | じゃがいも           |      300 |   324.00 |
|       3015 | しいたけ             |      150 |   162.00 |
|       4016 | チューチュークッキー |      200 |   216.00 |
|       4017 | いなごチップス       |      180 |   194.40 |
|       4018 | ありせんべい         |      320 |   345.60 |
|       4019 | チューチューアイス   |      110 |   118.80 |
|       4020 | こねずみジャーキー   |      120 |   129.60 |
|       5021 | 鰹節                 |      200 |   216.00 |
|       5022 | ネコ缶ナンバーワン   |      300 |   324.00 |
|       5023 | ネコ缶ダイエット     |      300 |   324.00 |
|       5024 | ネコ缶ローヤル       |      450 |   486.00 |
|       5025 | 煮干                 |      320 |   345.60 |
|       6026 | ねこマンマ           |      480 |   518.40 |
|       6027 | ツナおじや           |      460 |   496.80 |
|       6028 | ねずみキッシュ       |      500 |   540.00 |
|       6029 | ねこ草のごまあえ     |      230 |   248.40 |
|       6030 | バッタのそぼろ煮     |      360 |   388.80 |
|       7031 | ネコ砂               |      800 |   864.00 |
|       7032 | トイレトレイ         |     1200 |  1296.00 |
|       7033 | 引っ掻き板           |     1500 |  1620.00 |
|       7034 | 上り棒               |     3200 |  3456.00 |
|       7035 | ふかふか座布団       |     2800 |  3024.00 |
|       8036 | またたび             |      980 |  1058.40 |
|       8037 | またたび煙草         |      200 |   216.00 |
|       8038 | 骨                   |      560 |   604.80 |
|       8039 | またたびガム         |      120 |   129.60 |
|       8040 | マタタビドリンク     |      240 |   259.20 |
|       9041 | ネコジャラシ         |      870 |   939.60 |
|       9042 | 毛糸玉               |      210 |   226.80 |
|       9043 | ボール               |      150 |   162.00 |
|       9044 | チョロチュー         |      300 |   324.00 |
|       9045 | フリスビー           |      450 |   486.00 |
|      10046 | 鈴                   |       50 |    54.00 |
|      10047 | 首輪                 |     1300 |  1404.00 |
|      10048 | リボン               |      800 |   864.00 |
|      10049 | 足輪                 |      600 |   648.00 |
|      10050 | 毛止めクリップ       |      350 |   378.00 |
|       NULL | サカナまっしぐら     |      270 |   291.60 |
+------------+----------------------+----------+----------+
51 rows in set (0.001 sec)


-- 「||」を文字列連結演算子として使用する設定
SET sql_mode = 'PIPES_AS_CONCAT';

-- 問13
-- テーブルEmployeesのEmployeeNameとEmailを用いて「○○さんのメールアドレスは"△△"」を組み立て
-- 「連絡先」と別名をつけなさい。

SELECT
 EmployeeName || 'さんのメールアドレス"' || Email || '"' AS "連絡先"
FROM
  Employees
;

+-----------------------------------------------------+
| 連絡先                                              |
+-----------------------------------------------------+
| シマゴローさんのメールアドレス"simagoro@nekoyasudo" |
| ゴッチンさんのメールアドレス"gochin@nekoyasudo"     |
| マキ子さんのメールアドレス"maki@nekoyasudo"         |
| マルさんのメールアドレス"maru@nekoyasudo"           |
| ミチローさんのメールアドレス"michiro@nekoyasudo"    |
| チーさんのメールアドレス"coo@nekoyasudo"            |
| サラさんのメールアドレス"sara@nekoyasudo"           |
| みなみさんのメールアドレス"minami@nekoyasudo"       |
| プリンさんのメールアドレス"prin@nekoyasudo"         |
| ぴー子さんのメールアドレス"pko@nekoyasudo"          |
| ごまさんのメールアドレス"goma@nekoyasudo"           |
| ぱんださんのメールアドレス"panda@nekoyasudo"        |
| 猫丸さんのメールアドレス"nekomaru@nekoyasudo"       |
| ニャン太さんのメールアドレス"nyantaro@nekoyasudo"   |
| モンチーさんのメールアドレス"monchi@nekoyasudo"     |
| ぴよさんのメールアドレス"piyo@nekoyasudo"           |
| ラスカルさんのメールアドレス"rasukal@nekoyasudo"    |
| くまさんのメールアドレス"kuma@nekoyasudo"           |
| ゴンさんのメールアドレス"gon@nekoyasudo"            |
| チーさんのメールアドレス"q@nekoyasudo"              |
| 太助さんのメールアドレス"tasuke@nekoyasudo"         |
| トントンさんのメールアドレス"tonton@nekoyasudo"     |
| マーさんのメールアドレス"ma@nekoyasudo"             |
| サリーさんのメールアドレス"sary@nekoyasudo"         |
| うさぎさんのメールアドレス"usa@nekoyasudo"          |
| うー太さんのメールアドレス"uta@nekoyasudo"          |
| ローリーさんのメールアドレス"roly@nekoyasudo"       |
| マイケルさんのメールアドレス"mikel@nekoyasudo"      |
| スーさんのメールアドレス"su@nekoyasudo"             |
| ミーヤさんのメールアドレス"miya@nekoyasudo"         |
| モクモクさんのメールアドレス"moku@nekoyasudo"       |
+-----------------------------------------------------+
31 rows in set (0.001 sec)

-- 問14
-- テーブルEmployeesの社員数を求めて、「社員数」と別名をつけなさい。

SELECT
  COUNT(*) AS "社員数"
FROM
  Employees
;

+--------+
| 社員数 |
+--------+
|     31 |
+--------+

-- 問15
-- テーブルProductsのPriceの最大値、最小値をもとめそれぞれ「最高額価格」、「最低額価格」と別名をつけなさい

SELECT
  MAX(Price) AS "最高額価格",
  MIN(Price) AS "最低額価格"
FROM
  Products
;

+------------+------------+
| 最高額価格 | 最低額価格 |
+------------+------------+
|       3200 |         35 |
+------------+------------+